Repository: LordPax/backup
Catalog: locale/*/backup.po
Languages: fr

source: Usage : $0 [option] Option : -h or --help ........................... Show help -v or --version ........................ Show version -f \"<dir1> [dirN]\" ..................... Source folder -o <outputDir> ......................... Destination folder -p <pass> .............................. Pass phrase -c <config> ............................ File which contain source folders name -l <logFile> ........................... Log file -n <name> .............................. Name of output archive (automatically add .tar.gz) Example : backup -f \"dir_1 dir_2 dir_3\" -o dest_folder backup -c config.txt -o dest_folder backup -f \"dir_1 dir_2 dir_3\" -o dest_folder -l logfile.log backup -f \"dir_1 dir_2 dir_3\" -o dest_folder -p passphrase
fr: Usage : $0 [option] Option : -h or --help ........................... Affiche l'aide -v or --version ........................ Affiche la version -f \"<dir1> [dirN]\" ..................... Dossier source -o <outputDir> ......................... Dossier destination -p <pass> .............................. Phrase de pass -c <config> ............................ Fichier qui contien le nom des dossiers source -l <logFile> ........................... Fichier de log -n <name> .............................. Nom de l'archive (ajout√© automatiquement .tar.gz) Example : backup -f \"dir_1 dir_2 dir_3\" -o dest_folder backup -c config.txt -o dest_folder backup -f \"dir_1 dir_2 dir_3\" -o dest_folder -l logfile.log backup -f \"dir_1 dir_2 dir_3\" -o dest_folder -p passphrase

source: Source \"$file\" folder does not exist
fr: Le dossier source \"$file\" n'existe pas

source: Source folder is missing
fr: Dossier source manquant

source: Destination \"$backup_dest\" folder does not exist
fr: Dossier destination \"$backup_dest\" n'existe pas

source: Destination folder is missing
fr: Dossier destination manquant

source: Passphrase is missing
fr: Passphrase manqante

source: Log file is missing
fr: Fichier log manquant

source: Encryption of $backup_dest/$archive_name
fr: Chiffrement de $backup_dest/$archive_name

source: Something wrong with encrytion
fr: Quelque chose c'est mal passer avec le chiffrement

source: Encryption $backup_dest/$archive_name.gpg end
fr: Chiffrement de $backup_dest/$archive_name fini

source: Compress of :
fr: Compression de :

source: Something wrong with compression
fr: Quelque chose c'est mal passer avec la compression

source: Backup $backup_dest/$archive_name end
fr: Backup $backup_dest/$archive_name fini
